Revit 2026 API

# RebarShapeConstraint180DegreeDefaultBend Properties

---

The RebarShapeConstraint180DegreeDefaultBend type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from RebarShapeConstraint) |

#### Reference

RebarShapeConstraint180DegreeDefaultBend Class

Autodesk.Revit.DB.Structure Namespace